Подсказки: 

Некоторые значения.
 Запрос byte in, mk, i;float — это синтаксис объявления переменных на языке программирования 
  C++,
  где byte (в некоторых компиляторах unsigned char), in и mk — это имена переменных 
  типа byte, i — имя переменной типа int, а float 
  (или f) — ключевое слово для объявления переменной
   типа с плавающей точкой одинарной точности, которая занимает 4 байта. 

byte (или unsigned char) — это целочисленный тип данных, который 
занимает 1 байт (8 бит) и хранит беззнаковые значения от 0 до 255.
in и mk — это имена переменных, которые будут иметь тип byte
 (или unsigned char).

i — это имя переменной типа int, то есть целого числа.
float — это тип данных для хранения дробных чисел
 с одинарной точностью (32-битные числа с плавающей точкой), 
 занимающий 4 байта. 


 byte: Объявляет тип данных. Это беззнаковый 8-битный целочисленный тип, 
 который может хранить значения от 0 до 255.
 in,mk,i: Имена переменных, которые вы объявляете.
  ;: Завершает инструкцию. 